NOT_FOUND_WEATHER_TEXTS = [
    
    f'Чёт я не нашла.' \
    f' Галя! Гааа-ляяя! Ты слышала про такой город?' \
    f' C кем ты туда ездила? А, я так и думала. А чего меня не позвала? ...' \
    f'\n\nОй, сударь, вы ещё здесь? Извините, такого города не существует',
    
    f'Мне лень',

    f'Ну вот, опять вставать, куда-то идти ...',
    
    f'Сударь, вы погоду на улице видели? Вы правда хотите, чтобы' \
    f' я встала и пошла узнавать вам погоду в такую погоду?',
    
    f'Извините, сегодня не могу. Ох, какая нынче чача у Бачухи ...',
    
    f'Закрыты на переучёт товара',

    f'Уехала на десятую международную конференцию в Гааге. Выступила с пакетом' \
    f' конструктивных предложений, направленных на углубление процесса интеграции. ' \
    f' Не до погоды мне, сударь',

    f'Ох, ребята, там ... нет, я не могу это произнести. В общем, держитесь.' \
    f' Хорошего вам настроения!',
    
    f'Увольте, сударь. Не велено вас пущать',
    
    f'Добрый день, сударь! Погода выдаётся в любом нашем отделении' \
    f' в г. Москва без очередей и выходных!' \
    f' Спасибо за использование наших услуг.' \
    f' Оцените наш сервис, когда вернётесь из г. Москва!',
    
    f'Вот зачем вам погода? Бегать, на велике кататься, парки посещать?' \
    f' Пустое это всё. А давайте лучше вместе читать Фихтенгольца с выражением',
    
    f'А помнишь ли ты старенький приёмник из детства, который бодрым' \
    f' дикторским голосом' \
    f' зачитывал, что в Екатеринбурге переменная облачность,' \
    f' в Ременаме дожди? А теперь у тебя я. Извини ...',
]

NOT_FOUND_WEATHER_IMAGE_TEXT = '\n\nМожно ваш паспорт? Спасибо. Таааак ...' \
    f' Галя, не видишь, я занята. Что там у вас  ... аааа, ну конечно!' \
    f' А вы вообще в курсе, что вам никакие графики никаких температур не положены?' \
    f' Да, совсем. Не задерживайте очередь.' \
    f' Если вам так надо,' \
    f' подходите завтра к 8 утра в регистратуру с анализами.' \
    f' За результатами через 60 рабочих дней. Что вам ещё?' \
    f' Нет, через госуслуги нельзя. До свидания.\n\nИшь, прогноз погоды им подавай'
    
EMPTY_ADD_TEXT = f'Здравствуйте. Кажется, вы нажали команду\n\n/add\n\nв меню.' \
        f' Вам-то хорошо, нажали и нажали. А наш департамент' \
        f' на ушах: все хотят знать, какой город вы хотите добавить' \
        f' в напоминалки. Все бегают, шумят, волосы рвут. ' \
        f' Ставки делают, морды бьют. И никто ничего' \
        f' не знает, никто не за что не отвечает. Что за народ!' \
        f' можно вас попросить сказать им уже город, а то они всё тут разнесут?' \
        f' Ну, например, так: \n\n/add Ярославль'
        
CITY_CITY_TEXT = f'Добро пожаловать на метеостанцию. Располагайтесь,' \
        f' чайку? Унты не ставьте близко к камину, сядут-с ... ' \
        f' Вы какие сигары предпочитаете, La Gloria Cubana? Romeo y Julieta?' \
        f' Простите, конечно, перехожу к вашему делу.' \
        f' Вы точно хотите послать гонцов в город city? Да, мои парни, конечно,' \
        f' могут и не такое, и собаки хорошо отдохнули. Только, вот, не хотите ли,' \
        f' вместо мифического\n\n/city\n\n, узнать погоду в городе\n\n/Оймякон?\n\n' \
        f' Или, допустим, в\n\n/Могадишо\n\n? Вы, кстати, были в Могадишо?' \
        f' Я вот вам очень советую. Очень, знаете ли, хорошее место, чтобы там' \
        f' не бывать. Я вот там не был и видите, как мне это понравилось ...' \
        f' Эх, да ... Вот же ж какого времени не было ... Хорошо.'
        
BUTTON_WEATHER_HERE_TEXT = f'Погода прямо тут'
