not_found_weather_messages = [
    
    f'Чёт я не нашла.' \
    f' Галя! Гааа-ляяя! Слушай, ты слышала про такой город?' \
    f' C кем ты туда ездила? А, ну так я и думала.' \
    f'\n\nВ общем, извините, такого города не существует',
    
    f'Мне лень',

    f'Блин, опять вставать, куда-то идти ...',
    
    f'Чел, ты погоду на улице видел? Ты хочешь, чтобы' \
    f' я встала и пошла узнавать тебе погоду в такую погоду?',
    
    f'Извини, сегодня не могу. Ох, какая нынче чача у Бачухи ... ',

    f'Уехала на десятую международную конференцию в Гааге. Выступила с пакетом' \
    f' конструктивных предложений, направленных на углубление процесса интеграции. ' \
    f' Не до погоды мне, сударь',

    f'Ох, ребята, тут такая погода ... в общем, держитесь тут. Хорошего вам настроения!',
    
    f'Увольте, сударь. Не велено вас пущать',
    
    f'Погода выдаётся в любом нашем отделении в городе Москва без очередей и выходных!',
    
    f'Вот зачем вам погода? Бегать, на велике кататься, парки посещать?' \
    f' Пустое это всё. А давайте лучше вместе читать Фихтенгольца с выражением',
    
    f'А помнишь ли ты старенький приёмник из детства, который бодрым дикторским голосом' \
    f' зачитывал, что в Екатеринбурге переменная облачность, в Ременаме дожди? А теперь у тебя я. Извини ...',
]