not_found_weather_messages = [
    
    f'Чёт я не нашла.' \
    f' Галя! Гааа-ляяя! Ты слышала про такой город?' \
    f' C кем ты туда ездила? А, я так и думала. А чего меня не позвала? ...' \
    f'\n\nОй, сударь, вы ещё здесь? Извините, такого города не существует',
    
    f'Мне лень',

    f'Ну вот, опять вставать, куда-то идти ...',
    
    f'Сударь, вы погоду на улице видели? Вы правда хотите, чтобы' \
    f' я встала и пошла узнавать вам погоду в такую погоду?',
    
    f'Извините, сегодня не могу. Ох, какая нынче чача у Бачухи ...',
    
    f'Закрыты на переучёт товара',

    f'Уехала на десятую международную конференцию в Гааге. Выступила с пакетом' \
    f' конструктивных предложений, направленных на углубление процесса интеграции. ' \
    f' Не до погоды мне, сударь',

    f'Ох, ребята, тут такая погода ... в общем, держитесь тут.' \
    f' Хорошего вам настроения!',
    
    f'Увольте, сударь. Не велено вас пущать',
    
    f'Добрый день, сударь! Погода выдаётся в любом нашем отделении' \
    f' в г. Москва без очередей и выходных!' \
    f' Спасибо за использование наших услуг.' \
    f' Оцените наш сервис, когда вернётесь из г. Москва!',
    
    f'Вот зачем вам погода? Бегать, на велике кататься, парки посещать?' \
    f' Пустое это всё. А давайте лучше вместе читать Фихтенгольца с выражением',
    
    f'А помнишь ли ты старенький приёмник из детства, который бодрым' \
    f' дикторским голосом' \
    f' зачитывал, что в Екатеринбурге переменная облачность,' \
    f' в Ременаме дожди? А теперь у тебя я. Извини ...',
]